{
  "posts": [
    {
      "id": 9,
      "title": "You Don't Lose Everyone at Once",
      "date": "2024-01-31",
      "excerpt": "I just finished a long conversation with my dad, and it hit me how many people you lose over the years, more than you can count.",
      "content": "<p>I just finished a long conversation with my dad, and it hit me how many people you lose over the years, more than you can count.</p>\n\n<p>The thing is, you don't lose everyone at once. That's the tricky part. Someone goes five months ago, another on a random Sunday, and before you know it, the list gets longer.</p>\n\n<p>Most times, you only count the death of your immediate loved ones, like they're the only ones that matter. But when you sit down and really think about it, you realize there are so many others. People you once knew. People you had conversations with. People who were part of your formative years, or who you laughed with, or simply crossed paths with.</p>\n\n<p>Not a celebrity on TV. Not a face in the media. Real people you interacted with, even if only for a moment. A friend of a friend. A colleague. A mutual. And when you start putting names to it, you realize how many of them are actually gone. That switch in your head is heavy.</p>\n\n<h2>The Randomness of Loss</h2>\n\n<p>You might think death has a formula. Old age. Sickness. But it doesn't. It shows up in random ways. A young pregnant woman in childbirth, the baby survives but she doesn't. A guy in his twenties, full of life, gone in a car crash. A back ache that turns into a hospital rush, and then no more. Someone who goes to bed and never wakes up. Even standing at a bus stop when a car swerves. There's no neat pattern, no script.</p>\n\n<h2>Carrying Forward</h2>\n\n<p>And so what do you do? You carry the memories of those who've gone. You pray for their peace. And you keep moving with what you have. Because while people are leaving, life is still unfolding. Good things are still happening. And only God knows what tomorrow will bring.</p>\n\n<p>May the souls of all those we've lost rest in perfect peace.</p>",
      "slug": "you-dont-lose-everyone-at-once"
    },
    {
      "id": 8,
      "title": "Love Feels Like Magic Until It Doesn't",
      "date": "2024-01-30",
      "excerpt": "Intimate relationships are dicey. That's the truth nobody likes to say out loud.",
      "content": "<p>Intimate relationships are dicey. That's the truth nobody likes to say out loud. You meet someone in the most random way and it feels like a small miracle. Instagram. A dating app. Your church lobby after service. Two treadmills apart at the gym. A friend of a friend at a barbecue. Sometimes you knew them before and it was nothing, then one day the air changes and suddenly it's something.</p>\n\n<p>At first it's light. You trade jokes. You learn their coffee order. You start waiting for their name to pop up on your screen. Your brain flips a switch and this regular person becomes glow-in-the-dark. Their flaws are still there, you just can't see them clearly. The little roll of their eyes is now \"cute.\" Their messy room is \"creative chaos.\" You tell yourself you're being logical, but you're not. It's hormones, hope, and timing, all mixing like gasoline.</p>\n\n<p>You feel the rush. You wake up eager to call but scared to call too much. You tell your friends, \"It's different.\" You brag about the way they laugh. You excuse the thing that should bother you, because love is loud and red flags are quiet in that season. You start using \"we.\" You imagine holidays. You picture apartments. You try their favorite shows. You fold parts of their life into yours like you're packing a suitcase for two.</p>\n\n<p>If it's mutual and life behaves, you might build something real. Maybe there's a ring. Maybe kids. Maybe a home that smells like breakfast on Saturday mornings. That happens. It just doesn't happen for most people, most of the time.</p>\n\n<h2>The Drift</h2>\n\n<p>What happens more often is the drift. The same story with different costumes.</p>\n\n<p>Someone texts less. Someone texts more. One person loves through acts, the other needs words. One thinks silence means peace, the other hears silence and thinks rejection. There are tiny slights that never get named. There are apologies that sound like excuses. There's the \"I'm fine\" that isn't fine. There's \"work is crazy right now.\" There's a friend who suddenly has a lot to say about your partner. There's a new follower who laughs a little too hard in the comments. One night you snap at each other and forget what started it. Both of you say things you can't pull back into your mouth.</p>\n\n<p>Sometimes it doesn't even explode. Sometimes it goes flat. The love doesn't die. It just fades like a shirt washed one time too many. The same stories stop being funny. The same habits start feeling heavy. You realize you were in love with a version of them that only lived in your head. Or they were in love with your potential and got tired of waiting for the finished product.</p>\n\n<p>Other times it's messy. Somebody cheats. Somebody lies by omission and then by practice. Somebody starts keeping score. Resentment grows roots. Therapy happens. Or blocking happens. Or both. You tell yourself, \"I thought I really liked this girl,\" and the answer is you did. You just liked her through foggy glass, with the brightness turned up to ten.</p>\n\n<h2>The Hard Truth</h2>\n\n<p>Here's the part that sounds harsh but is honest. If you look at the world the way it is, the default outcome for relationships is not forever. That doesn't mean love is fake. It means love is fragile. People change jobs, cities, bodies, values, moods. They get sick. They get offered a new life and take it. They get tired. They get curious. They get scared. And fear makes people pick the safest story they can live with, even if that story doesn't include you.</p>\n\n<p>I've seen couples with forty years on the clock fold in the forty-first. Not because they were evil. Because they were human. The promise was real when they said it. Life just kept talking after they finished their vows.</p>\n\n<h2>How to Love Without Lying to Yourself</h2>\n\n<p>So what do you do with that? How do you love someone without lying to yourself?</p>\n\n<p>You accept that love is not a spell, it's a skill. Feelings are the spark. Habits keep the lights on. Attraction is loud and automatic. Partnership is quiet and deliberate. If you choose someone, you are choosing their rhythm, their stress responses, their family, their history with money, their habits with phones, their patience level when the Wi-Fi drops, their ability to apologize without defending themselves in the same breath. You are also choosing who you become around them. That second part might matter more.</p>\n\n<p>You set terms that are real, not romantic. What does respect look like on Tuesday night when both of you are tired. What does repair look like after the stupid fight over nothing. How do you tell the truth when the truth will make the other person's face fall. What is cheating to you besides sex. DMs. Emotional play-fighting with an ex. \"Likes\" at 2 a.m. What are the rules around privacy. Around friends who drink until they forget their promises. Around money and how it moves.</p>\n\n<p>You watch actions. Anyone can write poetry in your WhatsApp. Not everyone can show up when your car battery dies in the rain, when you have a fever, when your business takes a loss, when your family brings drama to your doorstep. Love is a verb with receipts.</p>\n\n<p>You hold it lightly, but not carelessly. You celebrate when it's good, and when it's shaky, you either fix it with both hands or you let it go with both hands. Half-work is disrespect. So is staying for convenience and calling it sacrifice.</p>\n\n<p>And if it ends, you let the ending be a teacher instead of a tattoo. You can grieve without turning your heart into cement. You can tell the truth about what happened without making the other person a villain in every chapter. You can find softness without losing standards.</p>\n\n<p>If you're asking me for one sentence to end on, here it is:</p>\n\n<blockquote><p>Love is beautiful, but it isn't bulletproof, so build the armor too.</p></blockquote>",
      "slug": "love-feels-like-magic-until-it-doesnt"
    },
    {
      "id": 7,
      "title": "People Don't Love My Writing. They Love My Honesty.",
      "date": "2024-02-06",
      "excerpt": "People sometimes tell me, \"I love the way you write\" or \"You should write a book.\" I always find that interesting because I don't see myself as a typical writer.",
      "content": "<p>People sometimes tell me, \"I love the way you write\" or \"You should write a book.\" I always find that interesting because I don't see myself as a typical writer. I'm not a Chimamanda, and I don't even read as much as I should. What makes my writing stand out isn't fancy language or deep literary knowledge. It's honesty. I write the way I think, and I let people see both the good and the bad. I don't try to dress things up. I just describe them as they are, even when it's uncomfortable. That's what makes people connect with it.</p>\n\n<h2>The Source of My Writing</h2>\n\n<p>I write because I overthink. Every conversation I have, I replay in my head: did I say too much? Should I have been calmer? Was something unnecessary? Writing helps me unload those thoughts and give them structure. It keeps me balanced. I don't keep it limited either. I write everything down: what I hear, who I talk to, what I feel. My writing isn't born from reading a hundred books. It comes from consuming content in pieces, having conversations, watching people, noticing reactions, and reflecting.</p>\n\n<h2>The Formula</h2>\n\n<p>So if there's any \"formula\" I can share, it's this: be brutally honest with yourself. Journal your thoughts, write without filters, and face your flaws on the page. The more honest you are with yourself, the more you'll end up writing words that speak to other people's problems and experiences.</p>",
      "slug": "people-dont-love-my-writing-they-love-my-honesty"
    },
    {
      "id": 6,
      "title": "The Science We Can't Explain",
      "date": "2024-02-05",
      "excerpt": "I love music. I really do. I don't even have a genre. I can listen to slow songs, fast ones, rap, soul, whatever. It doesn't matter.",
      "content": "<p>I love music. I really do. I don't even have a genre. I can listen to slow songs, fast ones, rap, soul, whatever. It doesn't matter. And the funny thing is, I can't even explain why it hits the way it does. Sometimes I sit back and wonder, is there a science behind good music? How does an artist take random words, throw them on a beat, step into a studio somewhere, and somehow reach my soul on the other side of the world?</p>\n\n<p>Think about it. A person you've never met, living a life completely different from yours, puts together a song, and now it's stuck on repeat on your phone. It changes your whole mood. That's wild. It makes me ask, how do they even pull it off?</p>\n\n<h2>The Deeper Connection</h2>\n\n<p>Because music isn't just sound. It's not just words or rhythms. It's something deeper. It's a mirror for the soul. You feel seen, you feel heard. Sometimes it's the lyrics, sometimes it's the beat, sometimes it's the story behind it. But somehow it always finds a way to connect.</p>\n\n<p>You can be sad and play an uplifting track and suddenly the weight lifts. You can be down and press play on a motivational song and now you're fired up. Or you can sit with a song that matches your pain and it pulls you even deeper into it. And at the end of the day, you realize it's just words, it's just sounds. But the way music bends those words and sounds together, it becomes something much more.</p>\n\n<p>That's the magic. That's why I love music.</p>",
      "slug": "the-science-we-cant-explain"
    },
    {
      "id": 5,
      "title": "Before You Know It, It's Friday",
      "date": "2024-02-04",
      "excerpt": "Sometimes it feels like the clock is sprinting and you're stuck trying to catch up. Classes, assignments, applications, bills, registrations, immigration papers, deadlines.",
      "content": "<p>Sometimes it feels like the clock is sprinting and you're stuck trying to catch up. Classes, assignments, applications, bills, registrations, immigration papers, deadlines. It piles up until you can't tell where to start. You're tired, but time isn't tired. Time doesn't wait.</p>\n\n<p>Monday blinks into Friday. Thirty days turn into a month that's already gone. People are born. People die. Friends drift. People outgrow each other in the space of a season. Life keeps moving—no pause button, no warning, just motion.</p>\n\n<h2>The Universal Race</h2>\n\n<p>It's easy to think it's just you, but it's not. Everyone is running some version of the same race. Different tracks, same clock. Some are studying. Some are working three jobs. Some are trying to survive. Some are chasing love. Some are just trying to feel alive. But all of us are living under the same sky, and time moves for all of us.</p>\n\n<p>That's the beauty and the weight of it. Time is brutal and kind at the same time. It takes, but it also gives. It pushes you forward even when you don't feel ready. It forces you to grow, to move, to shift. It's not about having a neat end goal. It's about realizing you're part of something bigger, and acting like your hours matter, because they do.</p>\n\n<h2>Living Inside Time</h2>\n\n<p>Take a breath. Step back. Look at the clock not as an enemy but as a reminder. This is your life moving. Your season. Your chance. The assignments, the applications, the work—they're not just tasks. They're the bricks you're laying. Little by little, brick by brick.</p>\n\n<p>Because in the middle of the chaos, there's still power in showing up. One call here. One form there. One step at a time. That's how you live inside time instead of being swallowed by it.</p>",
      "slug": "before-you-know-its-friday"
    },
    {
      "id": 4,
      "title": "Move-In Day",
      "date": "2024-02-03",
      "excerpt": "It's September 1st and I'm walking through the university grounds, just watching. You can feel it right away, it's move-in day.",
      "content": "<p>It's September 1st and I'm walking through the university grounds, just watching. You can feel it right away, it's move-in day. New students are rolling in with their parents, dragging suitcases, laughing nervously, taking in the campus for the first time. Some parents look more anxious than the students, giving those last-minute pep talks before heading back home.</p>\n\n<p>It takes me back to my own first year. That rush of being somewhere completely new, everything wide open. Orientation week, meeting people who felt like strangers at first but became family later, taking pictures of everything like it was history in the making. Back then, the future was just one big blank page.</p>\n\n<h2>The Stories Beginning</h2>\n\n<p>I can already see the stories beginning to write themselves. Someone will fall for the person down the hall, love blooming in late-night talks and shared walks to class. Someone else will learn heartbreak for the first time, carrying that ache through lectures and quiet dorm rooms. Classes will hit harder, and the old habits from high school won't be enough anymore. Some will chase strength in the gym, trying to shape not just their bodies but their discipline. Others will taste freedom in ways they never could at home, saying yes to nights that blur into mornings, to choices that feel reckless and alive at the same time.</p>\n\n<h2>The Universal Journey</h2>\n\n<p>It's always the same story, but always new. The thrill, the mistakes, the laughter that echoes in hallways, the tears hidden under blankets, the lessons you never saw coming. This is where edges get softened, where people grow into themselves. Years from now, they'll look back and realize these were the moments that changed them. Right now, they don't know it. They're just stepping in, wide-eyed and fearless, standing at the beginning of a story they'll only understand in hindsight.</p>",
      "slug": "move-in-day"
    },
    {
      "id": 3,
      "title": "It's Not About If Life Hits You — It's When",
      "date": "2024-02-02",
      "excerpt": "I want you to think about this with me for a second. Take banks, for example. They have this thing called risk management.",
      "content": "<p>I want you to think about this with me for a second.</p>\n\n<p>Take banks, for example. They have this thing called risk management. I don't know the exact industry standard, maybe it's around a 20% default rate. That means for every 10 people they give credit to, 2 are guaranteed not to pay. They'll have bad credit, they'll default, whatever. But guess what? The bank still makes money. They're not delusional enough to think everyone will pay back. They already expect failure.</p>\n\n<p>Same with Walmart. Their whole brand is \"everyday low prices,\" but they get sued every single day. Just last year alone, they spent almost $2 billion on lawsuits and theft. And yet, they're still standing.</p>\n\n<p>Even in my own small business, I've had to do the same thing. I have insurance, sure, but I still set money aside just knowing that things will go wrong. It's not about if, it's about when.</p>\n\n<h2>The Personal Reality</h2>\n\n<p>And that's where this gets personal. Because life itself works the same way. We're all going to face our share of defaults and lawsuits, just in different forms. If it's not money problems, it's health problems. If it's not heartbreak, it's betrayal. If it's not addiction, it's death. And if somehow you dodge all of that, life will hit someone close to you and break you through them. Nobody escapes.</p>\n\n<p>That's why I don't want you to just hope for the best. I want you to get ready. Life will throw its punches. I need you to build the kind of mind that can take every hit and still keep standing.</p>\n\n<h2>The Mindset You Need</h2>\n\n<p>I love how Jawaharlal Nehru put it: \"I want to meet my troubles head-on. I want to see myself tossed into the aperture between the two horns of the bull. And being there, I determine that I am going to win, because such a fight requires all my faculties.\"</p>\n\n<p>That's the mindset you need to survive this world. You don't pray for the storms to never come. You learn how to stand tall when they do.</p>\n\n<p>In the real world, they call it insurance. I call it mental armor.</p>\n\n<p>Prepare yourself. It doesn't matter if you're ready or not. Life is coming.</p>",
      "slug": "its-not-about-if-life-hits-you-its-when"
    },
    {
      "id": 2,
      "title": "Everything All at Once, Somewhere on Highway 401",
      "date": "2024-02-01",
      "excerpt": "It's a little after 5 p.m., maybe close to 6. The sky is soft and low, that pale gold you get before it gives up to night.",
      "content": "<p>It's a little after 5 p.m., maybe close to 6. The sky is soft and low, that pale gold you get before it gives up to night. I'm pulling out of Ottawa, pointing the car toward Toronto. The clock on the dashboard blinks like it knows something I don't. I just finished renewing my Nigerian passport. The building smell is still on me. Paper. Ink. People who have been waiting too long.</p>\n\n<p>Out front, a girl is stranded on the curb. Her ride bailed. Phone at 2 percent. The look that says, I'm fine, but I'm not fine. We are going the same way. I tell her to give me a minute. I reshuffle a few things in my head, in my day, in my seat. She gets in. We both say thank you at the same time. It feels like a small blessing.</p>\n\n<p>We roll out. The light is clean. The road is open. The playlist is doing its thing. There is that first moment when the tires hum steady, and it feels like the world has decided not to fight me today.</p>\n\n<h2>The Call</h2>\n\n<p>Then the call about the move hits.</p>\n\n<p>I should have planned better. I knew about this job. I didn't lock in the crew until the last hour. Now the customer is angry about the timing, and I am seven hours from my main city trying to lead from the highway. I feel it in my chest first. That hot pinch that says, you did this to yourself. You know better. You've learned too much to still be here.</p>\n\n<p>I pull into the next lane. I start dialing. One guy is at his cousin's. Another is free in thirty. The driver can make it if I send gas money now. I send it. I promise an updated ETA. I apologize to the client. I apologize again. I offer a small discount. I hang up and call back. I keep the tone calm while my hands sweat. The girl beside me taps the window with her finger to the beat of a love song. She asks if I'm okay. I say yes. She doesn't know there is a small office in my head where everything is on fire.</p>\n\n<p>The pieces start to land. A crew forms out of thin air and loud favors. The truck turns on. The first box moves. Someone sends a photo. It is a coil of tape and a hand on a dresser. That hand calms me more than the photo. I smile at nothing. Relief floods in like the car just took a breath.</p>\n\n<p>I think about systems. I think about building them so this call never happens again. A calendar that doesn't forget. A message that goes out the day before. A number that rings to the right person every time. I make a promise to myself that I have made before. This is the last time I juggle knives for sport.</p>\n\n<h2>The Drift</h2>\n\n<p>Another song comes on. The kind that makes everything feel cinematic. She and I start trading stories. How the last relationship ended. What we learned. What we wish we had known earlier. There is laughter. There is an honest quiet. Somewhere in there I drift. I look out at the line of trees and wonder what I am doing with my life.</p>\n\n<p>My bank account does not match my brain. My experience does not match my position. I feel too smart to be this broke and too broke to feel this smart. Then a different thought slides in. None of this matters in the way I'm treating it. I am not dying. This panic has no blood in it. I let that sit. I let it cool me down.</p>\n\n<p>Hope sneaks back in the open window. The projects I'm building start walking through my mind. I can see them finished. I can see the numbers. I say the wild number I always say, the one with nine zeros, and it doesn't feel crazy. It feels like a map I keep folded in my pocket. I catch myself. You say this all the time. You can't keep saying it and still moving like this. I nod to myself like I've just been told the truth by someone I respect.</p>\n\n<p>Then the fear about permits shows up. That quiet paper fear that stays behind the loud things. I add it to the stack. I don't solve it. I keep driving.</p>\n\n<h2>The Present Moment</h2>\n\n<p>We pass an exit with a name I like. We pass another with a gas station that looks better than it is. My phone buzzes. The job is moving. The client has softened. The photo of the dresser has become the photo of a cleared hallway. I can breathe again.</p>\n\n<p>She turns the music up. A love song, the type with simple words that land heavier than they should. She sings a little. I answer with a line or two. Our voices catch on the same word. I feel present. Then I slip away. She asks, again, if I'm good. I am. I am not. Both can be true.</p>\n\n<p>We talk about the stupid little firsts you only notice when you like someone. The first time they say your name like they actually see you. The first time you leave a hoodie behind on purpose. The first time you stop checking your phone because they are right there. We laugh. The car feels bigger than it is.</p>\n\n<p>Then my head flips back to the list. Money. Teams. Deadlines. The idea that could be everything if I stop dragging my feet. It happens fast. It always happens fast. Happy. Sad. Calm. Fear. Hope. Shame. Confidence. Repeat. It rolls through like weather. Sunshine that changes to rain without a cloud in the sky. I try to hold one feeling, and it slides out of my hands.</p>\n\n<h2>The Truth</h2>\n\n<p>Toronto creeps closer on the signs. The day folds into a darker blue. I turn the volume down to hear my thoughts and it doesn't help. She leans her head back. The road keeps coming.</p>\n\n<p>Here is the truth I can live with. A person can carry all of it at once. Joy sitting next to doubt. Hunger sitting next to peace. The future shouting while the present whispers. Sometimes the point is not to fix the mix. Sometimes the point is to keep driving and let the feelings lap over each other like lanes on the highway. You choose the next exit. You keep your hands steady. You get where you said you'd go.</p>\n\n<p>If someone asks how I felt on that drive, I could say one word and it would lie. The real answer is a handful of stations changing under one hand. Love song. Work call. Prayer. Plan. Silence. Laugh. Repeat. And somehow it all belongs.</p>",
      "slug": "everything-all-at-once-somewhere-on-highway-401"
    },
    {
      "id": 10,
      "title": "Confronting Mortality: A Personal Reflection",
      "slug": "confronting-mortality-a-personal-reflection",
      "date": "2025-11-27",
      "excerpt": "A poignant reflection on the first encounter with mortality that reshapes one's understanding of life and death.",
      "content": "<p>I’ve always felt a pressure to write. I tell myself that writing clearly makes me think clearly, but life usually gets in the way. Today, though, a video stopped me in my tracks. It was about a subculturally-famous skit maker who passed away recently, someone I didn’t even know until the news of his death broke. He died of complications from high blood pressure, perhaps worsened by lifestyle choices.</p>\n\n<p>That news triggered a memory I haven’t touched in 10 years. It was my first real collision with mortality.</p>\n\n<p>I was back in boarding school, maybe JSS3 or SS1(Grade 9 or 10). I had a mild case of chicken-pox, but to be honest, I decided to milk it. In hindsight, I didn't need a doctor; I just needed to get out. Anyone who went to a strict boarding school understands the urge to see the “outside world,” even if it’s just the local hospital.</p>\n\n<p>So, I exaggerated every symptom. I played the part well enough that the school nurse panicked and authorized a trip to the General Hospital.</p>\n\n<p>I felt like I had won. I was sitting in the school's Hilux, cruising toward \"freedom.\" </p>\n\n<p>When we got to the General Hospital, reality started to set in. It wasn't the sterile, quiet environment you see in movies. It was an open space, separated only by flimsy curtains. It was chaotic in that typical Nigerian-hospital way. People were everywhere - families anxious, tired, others praying quietly, some sleeping on the bare floor, just waiting.</p>\n\n<p>I sat there in my school uniform, acting way more miserable than I actually felt, pretending to be sick but mainly just enjoying the break from school. That’s when I saw her.</p>\n\n<p>There was a baby, maybe a couple of months old, hooked up to an oxygen cylinder that looked massive next to her tiny frame. This wasn’t a small medical device; it was a tall, industrial-looking tank. But it was her chest that froze me.</p>\n\n<p>I don't know how to describe what I saw.</p>\n\n<p>I have never seen a human body move like that. It wasn’t breathing; it was heaving. Her chest was pounding against her ribs with a violence that didn't seem possible for something so small. It looked like a car hitting speed bumps at full velocity - boom, boom, boom. Fast. Aggressive. Terrifying.</p>\n\n<p>Two doctors were hovering over her. Her parents were standing to the side, praying silently, their lips moving in desperate rhythm with the machine.</p>\n\n<p>I watched this for maybe fifteen minutes. Maybe longer. Time does strange things when you're watching someone fight for their life. I was transfixed.</p>\n\n<p>And then, abruptly, the aggressive rhythm stopped. The heaving ceased.</p>\n\n<blockquote><p>In the next second, the silence was shattered by a scream I will never forget. \"Jesus!\"</p></blockquote>\n\n<p>It was the mother. She was screaming at the top of her lungs, a raw, primal sound of loss. The kind of scream that hits you in your spine. It took three people - the doctors and her husband to hold her back as she thrashed. She was fighting them, wailing, asking God questions nobody could answer.</p>\n\n<p>I just sat there.</p>\n\n<p>In that instant, my exaggerated symptoms didn't just fade, it evaporated. The shock slapped the health back into me. I had blown a mild illness out of proportion just to see the outside world, and the world showed me its harshest truth immediately.</p>\n\n<p>It was the first time I realized death isn’t dramatic the way movies show it. It doesn’t announce itself. It doesn’t pause the world. It just happens, and the world keeps moving.</p>\n\n<p>It’s been over a decade since that sad occurrence. I know medical professionals see this every day; for them, it’s Tuesday. But for the rest of us, death is a reality we ignore until it screams in our faces.</p>\n\n<p>I don't know how to end this. I’m not trying to turn it into a motivational quote or a sermon about how life is meaningless. I’m just laying out the story the way it happened. It was the first time death stopped being an abstract idea and became a real thing in front of me.</p>\n\n<p>And maybe that’s the point: you don’t forget the first time you see life leave someone. It changes how you look at your own.</p>"
    },
    {
      "id": 11,
      "title": "The Frustration of Futuristic Bathroom Doors",
      "slug": "the-frustration-of-futuristic-bathroom-doors",
      "date": "2025-11-27",
      "excerpt": "Exploring the absurdity of high-tech bathroom doors that prioritize innovation over practicality, leaving users in awkward situations.",
      "content": "<p>Lately I’ve been thinking about something stupidly small but somehow important. It hit me at this restaurant I visit a few times a week. Great food. <strong>Terrible toilet design.</strong></p>\n\n<p>To get into the toilet, you have to wave your hand at the door. Fine. I don’t hate tech. I’ll wave. But once you get inside, the door refuses to close for a good thirty to forty seconds. I actually timed it. You can’t push it shut. You can’t force it. You just stand there like an idiot waiting for the future to catch up.</p>\n\n<p>And honestly, I don’t know who designed this because it’s the opposite of practical. Sure, wave-to-flush is nice. Wave-to-open? Also fine. But <strong>wave-to-open-then-wait-half-a-minute-for-it-to-close-while-you-stand-exposed</strong> is insane.</p>\n\n<p>I keep running scenarios in my head. What if I’m trying to get away from someone? What am I supposed to do—wave at the door while they’re right behind me, then wait politely for thirty seconds?</p>\n\n<p>What if I’m seconds away from destroying the place with a smell that could kill a small animal? I need that door shut immediately. Not in half a minute. And definitely not while people are walking by catching a preview.</p>\n\n<p>Or the worst: you open the door, someone’s right outside, you’re already pressed, and now you’ve got to start your business while the door is still sliding shut like it’s in slow motion. <strong>Zero privacy. Zero dignity.</strong></p>\n\n<p>And I’ve seen this same system in gyms, schools, random public places. It’s like someone decided <strong>“innovation” means ignoring common sense.</strong></p>\n\n<p>I’m not anti-tech. I just care about things actually working in real life. If a new design makes the basic user experience worse, it’s not innovation. It’s pointless.</p>\n\n<p>Anyway, maybe this sounds like a rant, but I know I’m not the only one who’s dealt with these useless futuristic doors. They’re hilarious in concept and annoying in practice.</p>"
    },
    {
      "id": 12,
      "title": "The Latency of Innovation: Why Smart Doors Are Stupid",
      "slug": "when-innovation-compromises-user-experience",
      "date": "2025-11-28",
      "excerpt": "Exploring how high-tech designs can compromise user experience and privacy, revealing a critical flaw in modern innovation.",
      "content": "<p>Lately, I’ve been thinking about how <strong>\"innovation\"</strong> often degrades user experience. It hit me at a high-end restaurant with a <strong>\"futuristic\"</strong> bathroom.</p>\n\n<p>To enter, you wave your hand. The door slides open. Fine. I don’t hate tech. But once inside, the door refuses to close for a timed interval of thirty to forty seconds. I actually timed it. You can’t push it shut. You can’t force it. You just stand there, exposed, waiting for the software to catch up to reality.</p>\n\n<p>This is a classic failure of <strong>\"Feature over Function.\"</strong></p>\n\n<p>The Feature: <strong>Touchless hygiene.</strong></p>\n\n<p>The Failure: <strong>Privacy latency.</strong></p>\n\n<p>The designer optimized for a metric (germ avoidance) but broke the fundamental use case (privacy). This creates a critical failure mode: If you enter urgently, or if someone is walking by, the system forces you to choose between hygiene and dignity.</p>\n\n<p>I keep running scenarios: What if I need to escape a threat? What if I am sick? The system demands I wait for its internal timer to expire before I am safe.</p>\n\n<p>I see this pattern everywhere—gyms, schools, airports. We are replacing mechanical certainty (a lock you can turn instantly) with digital uncertainty (a sensor that might detect you).</p>\n\n<p>I’m not anti-tech; I’m a founder building automation software. But I care about things actually working in the physical world. If a new design increases the latency of the basic user experience, it’s not innovation. It’s regression.</p>"
    }
  ]
}